#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_CheckpointStation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_CheckpointStation.BPAnim_CheckpointStation_C
// 0x1F20 (0x2360 - 0x0440)
class UBPAnim_CheckpointStation_C final : public UAnimInstance
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0440(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0448(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0450(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0478(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0490(0x0E78)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1308(0x0E78)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2180(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2270(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x22F8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2328(0x0030)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPAnim_CheckpointStation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPAnim_CheckpointStation_C")
	}
	static class UBPAnim_CheckpointStation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_CheckpointStation_C>();
	}
};
DUMPER7_ASSERTS_UBPAnim_CheckpointStation_C;

}

