#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Player_3rd

#include "Basic.hpp"

#include "GbxGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BPAnim_Player_3rd_structs.hpp"
#include "FaceFX_structs.hpp"
#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "PlayerCharacters_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Player_3rd.BPAnim_Player_3rd_C
// 0x25BB0 (0x27500 - 0x1950)
class UBPAnim_Player_3rd_C final : public UOakCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct BPAnim_Player_3rd::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;            // 0x1958(0x0050)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x19A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_BlendSpaceGraph;            // 0x19B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x19B8(0x0008)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_86;                    // 0x19C0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_36;                   // 0x19F0(0x0088)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_27;                 // 0x1A78(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_35;                   // 0x1B68(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_34;                   // 0x1BF0(0x0088)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_26;                 // 0x1C78(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_85;                    // 0x1D68(0x0030)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator_3;              // 0x1D98(0x0088)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_30;                      // 0x1E20(0x00D0)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator_2;              // 0x1EF0(0x0088)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_29;                      // 0x1F78(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x2048(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_84;                    // 0x20D0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_83;                    // 0x2100(0x0030)()
	struct FOakAnimNode_ArmIK                     OakAnimGraphNode_ArmIK;                            // 0x2130(0x0A50)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_25;                 // 0x2B80(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_82;                    // 0x2C70(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x2CA0(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x2D28(0x0088)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0x2DB0(0x0E78)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_81;                    // 0x3C28(0x0030)()
	struct FGbxAnimNode_Rotation_AimOffset        GbxAnimGraphNode_Rotation_AimOffset_5;             // 0x3C58(0x0160)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_24;                 // 0x3DB8(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x3EA8(0x0E78)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_28;                      // 0x4D20(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x4DF0(0x0E78)()
	struct FOakAnimNode_LimbTwist                 OakAnimGraphNode_LimbTwist;                        // 0x5C68(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x5CA0(0x0E78)()
	uint8                                         Pad_6B18[0x8];                                     // 0x6B18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x6B20(0x0550)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_90;                // 0x7070(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_89;                // 0x7170(0x0100)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x7270(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x72F8(0x0088)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x7380(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x73B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x73E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x7410(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x7440(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x7470(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x74A0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x74D0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x7500(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x7530(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x7560(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x7590(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x75C0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x75F0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x7620(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x7650(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x7680(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x76B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x76E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x7710(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x7740(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x7770(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x77A0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x77D0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x7800(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x7830(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x7860(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x7890(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x78C0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x78F0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x7920(0x0030)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_29;              // 0x7950(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x7A58(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_27;                      // 0x7A80(0x00D0)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_28;              // 0x7B50(0x0108)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10;                    // 0x7C58(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_88;                // 0x7D28(0x0100)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_27;              // 0x7E28(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x7F30(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x7F58(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x8030(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x8058(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x8088(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x80B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x80E8(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_87;                // 0x8118(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x8218(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_86;                // 0x8240(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x8340(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_9;                     // 0x8368(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_85;                // 0x8438(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_84;                // 0x8538(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_26;                      // 0x8638(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_83;                // 0x8708(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x8808(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x8830(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x8908(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x8930(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x8960(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x8990(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0x89C0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0x89F0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0x8A20(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_23;                 // 0x8A50(0x00F0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_82;                // 0x8B40(0x0100)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_26;              // 0x8C40(0x0108)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_81;                // 0x8D48(0x0100)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_2;               // 0x8E48(0x0040)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_80;                // 0x8E88(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_25;           // 0x8F88(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_79;                // 0x8FB0(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_24;           // 0x90B0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_78;                // 0x90D8(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_23;           // 0x91D8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_77;                // 0x9200(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_22;           // 0x9300(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_76;                // 0x9328(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_21;           // 0x9428(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_75;                // 0x9450(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_20;           // 0x9550(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_74;                // 0x9578(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_19;           // 0x9678(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_73;                // 0x96A0(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_18;           // 0x97A0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_72;                // 0x97C8(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_17;           // 0x98C8(0x0028)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph_3;                   // 0x98F0(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_8;                     // 0x9960(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19;                  // 0x9A30(0x0050)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_71;                // 0x9A80(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_16;           // 0x9B80(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_70;                // 0x9BA8(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_15;           // 0x9CA8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_69;                // 0x9CD0(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_14;           // 0x9DD0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_68;                // 0x9DF8(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_13;           // 0x9EF8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_67;                // 0x9F20(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_12;           // 0xA020(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_66;                // 0xA048(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_11;           // 0xA148(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_65;                // 0xA170(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_10;           // 0xA270(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_64;                // 0xA298(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_9;            // 0xA398(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_63;                // 0xA3C0(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_8;            // 0xA4C0(0x0028)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph_2;                   // 0xA4E8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0xA558(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_25;              // 0xA580(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0xA688(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_62;                // 0xA6B0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0xA7B0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_61;                // 0xA7D8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0xA8D8(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_24;              // 0xA900(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0xAA08(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0xAA30(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0xAB08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0xAB30(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0xAB60(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0xAB90(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0xABC0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0xABF0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0xAC20(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0xAC50(0x0030)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_23;              // 0xAC80(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0xAD88(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_22;              // 0xADB0(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0xAEB8(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_21;              // 0xAEE0(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0xAFE8(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_20;              // 0xB010(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0xB118(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_19;              // 0xB140(0x0108)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_25;                      // 0xB248(0x00D0)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_18;              // 0xB318(0x0108)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_24;                      // 0xB420(0x00D0)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_17;              // 0xB4F0(0x0108)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_23;                      // 0xB5F8(0x00D0)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_16;              // 0xB6C8(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0xB7D0(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0xB7F8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0xB8D0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_60;                // 0xB8F8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0xB9F8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_59;                // 0xBA20(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0xBB20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0xBB48(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0xBB78(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0xBBA8(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_58;                // 0xBBD8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0xBCD8(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_15;              // 0xBD00(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0xBE08(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_57;                // 0xBE30(0x0100)()
	struct FGbxAnimNode_IdleTurns                 GbxAnimGraphNode_IdleTurns_4;                      // 0xBF30(0x0370)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0xC2A0(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0xC2C8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0xC3A0(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_14;              // 0xC3C8(0x0108)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_22;                      // 0xC4D0(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_56;                // 0xC5A0(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_55;                // 0xC6A0(0x0100)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0xC7A0(0x0050)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_7;            // 0xC7F0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_54;                // 0xC818(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_53;                // 0xC918(0x0100)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0xCA18(0x0050)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_6;            // 0xCA68(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_52;                // 0xCA90(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_5;            // 0xCB90(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_51;                // 0xCBB8(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_4;            // 0xCCB8(0x0028)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph_1;                   // 0xCCE0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0xCD50(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_13;              // 0xCD78(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0xCE80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0xCEA8(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_50;                // 0xCED8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0xCFD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0xD000(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0xD030(0x0030)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_12;              // 0xD060(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0xD168(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_49;                // 0xD190(0x0100)()
	struct FGbxAnimNode_IdleTurns                 GbxAnimGraphNode_IdleTurns_3;                      // 0xD290(0x0370)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0xD600(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0xD628(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0xD700(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_48;                // 0xD728(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0xD828(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0xD850(0x0030)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_11;              // 0xD880(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0xD988(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_47;                // 0xD9B0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0xDAB0(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0xDAD8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0xDBB0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_46;                // 0xDBD8(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_21;                      // 0xDCD8(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_45;                // 0xDDA8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0xDEA8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_22;                 // 0xDED0(0x00F0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_44;                // 0xDFC0(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_43;                // 0xE0C0(0x0100)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0xE1C0(0x0050)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_42;                // 0xE210(0x0100)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0xE310(0x0050)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_41;                // 0xE360(0x0100)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_10;              // 0xE460(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0xE568(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0xE5B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0xE5E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0xE610(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_40;                // 0xE640(0x0100)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_21;                 // 0xE740(0x00F0)()
	struct FGbxAnimNode_Locomotion                GbxAnimGraphNode_Locomotion_3;                     // 0xE830(0x01E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0xEA18(0x0050)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_9;               // 0xEA68(0x0108)()
	struct FGbxAnimNode_Locomotion                GbxAnimGraphNode_Locomotion_2;                     // 0xEB70(0x01E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0xED58(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0xEDA8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_39;                // 0xEDD0(0x0100)()
	struct FGbxAnimNode_IdleTurns                 GbxAnimGraphNode_IdleTurns_2;                      // 0xEED0(0x0370)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0xF240(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0xF268(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0xF340(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0xF368(0x00D8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0xF440(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80;                    // 0xF4C8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79;                    // 0xF4F8(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0xF528(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0xF578(0x0030)()
	struct FGbxAnimNode_LayeredBoneSetBlend       GbxAnimGraphNode_LayeredBoneSetBlend_1;            // 0xF5A8(0x0148)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0xF6F0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0xF720(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0xF7A8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0xF7D8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0xF808(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0xF838(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0xF868(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0xF898(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_38;                // 0xF8C8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0xF9C8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_37;                // 0xF9F0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0xFAF0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_36;                // 0xFB18(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0xFC18(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_35;                // 0xFC40(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0xFD40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0xFD68(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0xFD98(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0xFDC0(0x00D8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0xFE98(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0xFF20(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0xFFA8(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0xFFD8(0x00D0)()
	struct FAnimNode_BlendFaceFXAnimation         AnimGraphNode_BlendFaceFXAnimation;                // 0x100A8(0x0088)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x10130(0x0088)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x101B8(0x0E78)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0x11030(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x11060(0x0E78)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x11ED8(0x0E78)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x12D50(0x0088)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_20;                 // 0x12DD8(0x00F0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_1;               // 0x12EC8(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x12F08(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x12FD8(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0x13060(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x13090(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_19;                 // 0x130B8(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x131A8(0x0E78)()
	struct FGbxAnimNode_LayeredBoneSetBlend       GbxAnimGraphNode_LayeredBoneSetBlend;              // 0x14020(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x14168(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0x141F0(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x14220(0x0E78)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_18;                 // 0x15098(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x15188(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0x15210(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0x15240(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17;                 // 0x15270(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x15360(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0x153E8(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0x15418(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x15508(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x155F8(0x0030)()
	uint8                                         Pad_15628[0x8];                                    // 0x15628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAnimNode_SlopeWarping              GbxAnimGraphNode_LegIK;                            // 0x15630(0x0620)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x15C50(0x0E78)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x16AC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x16AF0(0x0030)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x16B20(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x16C00(0x0030)()
	struct FGbxAnimNode_Rotation_AimOffset        GbxAnimGraphNode_Rotation_AimOffset_4;             // 0x16C30(0x0160)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x16D90(0x0E78)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x17C08(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x17C38(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x17CC0(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x17D48(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x17DD0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x17E00(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x17E30(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x17F20(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0x17F50(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x18020(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x18050(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x18080(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x180B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x180E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x18110(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x18140(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x18170(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x181A0(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0x181D0(0x00D0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_6;                      // 0x182A0(0x0018)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_34;                // 0x182B8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x183B8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0x183E0(0x00D0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_5;                      // 0x184B0(0x0018)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_33;                // 0x184C8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x185C8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_16;                      // 0x185F0(0x00D0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_4;                      // 0x186C0(0x0018)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_32;                // 0x186D8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x187D8(0x0028)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator_1;              // 0x18800(0x0088)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x18888(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3;                      // 0x188B0(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x188C8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x188F0(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x189C8(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x18A98(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_15;                      // 0x18AC8(0x00D0)()
	struct FGbxAnimNode_Rotation_AimOffset        GbxAnimGraphNode_Rotation_AimOffset_3;             // 0x18B98(0x0160)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x18CF8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x18DE8(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x18E18(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x18EA0(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x18ED0(0x0E78)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x19D48(0x0E78)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x1ABC0(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_31;                // 0x1ABF0(0x0100)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x1ACF0(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x1AD78(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x1ADA8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x1ADD8(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_30;                // 0x1AE08(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x1AF08(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x1AFD8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x1B028(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x1B058(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x1B148(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x1B1D0(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x1B200(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x1B2F0(0x0030)()
	struct FGbxAnimNode_Rotation_AimOffset        GbxAnimGraphNode_Rotation_AimOffset_2;             // 0x1B320(0x0160)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_14;                      // 0x1B480(0x00D0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x1B550(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1B640(0x0E78)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x1C4B8(0x0018)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_8;               // 0x1C4D0(0x0108)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator;                // 0x1C5D8(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x1C660(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x1C6B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x1C6E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x1C710(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x1C740(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x1C770(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x1C7A0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x1C7D0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1C800(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_29;                // 0x1C830(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x1C930(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x1C958(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x1C970(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_28;                // 0x1C998(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x1CA98(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_27;                // 0x1CAC0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x1CBC0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_26;                // 0x1CBE8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x1CCE8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x1CD10(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x1CDE8(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x1CEB8(0x0050)()
	uint8                                         Pad_1CF08[0x8];                                    // 0x1CF08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAnimNode_LegIK                     OakAnimGraphNode_LegIK;                            // 0x1CF10(0x06B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x1D5C0(0x00F0)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_7;               // 0x1D6B0(0x0108)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_13;                      // 0x1D7B8(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_12;                      // 0x1D888(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x1D958(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x1D988(0x00F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x1DA78(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x1DB48(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x1DB78(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x1DBA8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x1DBD8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x1DC08(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x1DC38(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x1DC68(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x1DC98(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x1DCC8(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_25;                // 0x1DCF8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x1DDF8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_24;                // 0x1DE20(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x1DF20(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_23;                // 0x1DF48(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x1E048(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_22;                // 0x1E070(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_21;                // 0x1E170(0x0100)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x1E270(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x1E2C0(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x1E2E8(0x00D8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1E3C0(0x0E78)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x1F238(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1F278(0x00D0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x1F348(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x1F438(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x1F4C0(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x1F4F0(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x1F578(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x1F5A8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x1F5D8(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x1F608(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x1F6F8(0x0088)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1F780(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_20;                // 0x1F850(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x1F950(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x1F980(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x1F9B0(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_11;                      // 0x1F9E0(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x1FAB0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x1FAE0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x1FB10(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x1FB40(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x1FB70(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1FBA0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1FBD0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1FC00(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x1FC30(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x1FC60(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x1FC90(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x1FCC0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x1FCF0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x1FD20(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x1FD50(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x1FD80(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x1FDB0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x1FDE0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x1FE10(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1FE40(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x1FE70(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x1FEA0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1FED0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1FF00(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_19;                // 0x1FF30(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x20030(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_18;                // 0x20058(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x20158(0x0028)()
