#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_Carryable_ExplodingObject_PropaneTank

#include "Basic.hpp"

#include "GbxEngine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Script_Carryable_ExplodingObject_PropaneTank.Script_Carryable_ExplodingObject_PropaneTank_C.ExecuteUbergraph_Script_Carryable_ExplodingObject_PropaneTank
// 0x01A0 (0x01A0 - 0x0000)
struct Script_Carryable_ExplodingObject_PropaneTank_C_ExecuteUbergraph_Script_Carryable_ExplodingObject_PropaneTank final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable;                              // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_1;                            // 0x0038(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageTags                            Temp_struct_Variable_2;                            // 0x0048(0x0020)(ConstParm)
	struct FHitResult                             Temp_struct_Variable_3;                            // 0x0068(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetActorState_ReturnValue;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_1;                      // 0x016C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_1;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_1;         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_2;         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState;                        // 0x0190(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState;                      // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_Carryable_ExplodingObject_PropaneTank_C_ExecuteUbergraph_Script_Carryable_ExplodingObject_PropaneTank;

// Function Script_Carryable_ExplodingObject_PropaneTank.Script_Carryable_ExplodingObject_PropaneTank_C.Exploding__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_Carryable_ExplodingObject_PropaneTank_C_Exploding__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_Carryable_ExplodingObject_PropaneTank_C_Exploding__OnStateEnabled;

}

