#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle

#include "Basic.hpp"

#include "GbxGame_structs.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK::Params
{

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.AboutToFire__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_AboutToFire__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_AboutToFire__OnStateEnabled;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.AnyPlayerCarryingAssociatedObject__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_AnyPlayerCarryingAssociatedObject__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_AnyPlayerCarryingAssociatedObject__OnStateEnabled;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.ContainsCarryable__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_ContainsCarryable__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_ContainsCarryable__OnStateEnabled;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.destroyed__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_destroyed__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_destroyed__OnStateEnabled;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.ExecuteUbergraph_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle
// 0x01F0 (0x01F0 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_ExecuteUbergraph_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_5;                      // 0x0004(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_5;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_4;                      // 0x0014(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_4;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_3;                      // 0x0024(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_3;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_2;                      // 0x0034(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_1;                      // 0x0044(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState;                        // 0x0054(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue;         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObject*                       K2Node_Event_CarryableObject;                      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFactAddress                           Temp_struct_Variable;                              // 0x0070(0x0038)(ConstParm, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_1;                            // 0x00A8(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFactHandle*                            CallFunc_ReadFactGetHandle_FactHandle;             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_2;                            // 0x00C0(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFactHandleAsInt32_ReturnValue;         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_1;       // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_6;                      // 0x00D8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_6;                    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_3;                            // 0x00E8(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_7;                      // 0x00F4(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_7;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_4;                            // 0x0104(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActorStateAsBool_ReturnValue;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActorStateAsBool_ReturnValue_1;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_LoadedOreCount;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Manager;                              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ExplosionCount;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Acceleration;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_9;                      // 0x0130(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_9;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_10;                     // 0x0140(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_10;                   // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_11;                     // 0x0150(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_11;                   // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_12;                     // 0x0160(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_12;                   // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_13;                     // 0x0170(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_13;                   // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_14;                     // 0x0180(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_14;                   // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_15;                     // 0x0194(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_15;                   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_16;                     // 0x01A4(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_16;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_17;                     // 0x01B4(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_17;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObject*                       K2Node_GbxActorScriptBoundEvent_CarryableObject;   // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_8;                      // 0x01D0(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_8;                    // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObjectContainer*              CallFunc_GetAssociatedActor_ReturnValue;           // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorStateAsBool_ReturnValue;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActorStateAsBool_ReturnValue_2;        // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_ExecuteUbergraph_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.FinishLoading__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_FinishLoading__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_FinishLoading__OnStateEnabled;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.FireFinished__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_FireFinished__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_FireFinished__OnStateEnabled;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.Firing__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_Firing__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_Firing__OnStateEnabled;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.GbxActorScriptEvt__OnCarryablePlacedInContainerBP
// 0x0008 (0x0008 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_GbxActorScriptEvt__OnCarryablePlacedInContainerBP final
{
public:
	class ACarryableObject*                       CarryableObject;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_GbxActorScriptEvt__OnCarryablePlacedInContainerBP;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.InterpHoloMaterial
// 0x0060 (0x0060 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_InterpHoloMaterial final
{
public:
	double                                        MaterialParam;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxMaterialParamInterpOptions         CallFunc_MakeGbxParamInterpOptions_ReturnValue;    // 0x0008(0x0020)(NoDestructor)
	struct FGbxMaterialParamInterpOptions         CallFunc_MakeGbxParamInterpOptions_ReturnValue_1;  // 0x0028(0x0020)(NoDestructor)
	class ACarryableObjectContainer*              CallFunc_GetAssociatedActor_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetBodyComponent_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_InterpScalar_NewValue_ImplicitCast;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_InterpScalar_NewValue_ImplicitCast_1;     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_InterpHoloMaterial;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.LoadIdle__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_LoadIdle__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_LoadIdle__OnStateEnabled;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.OpenToLoad__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_OpenToLoad__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_OpenToLoad__OnStateEnabled;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.SetManager
// 0x0008 (0x0008 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_SetManager final
{
public:
	class AActor*                                 Manager_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_SetManager;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.TransferAcceleration
// 0x0008 (0x0008 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_TransferAcceleration final
{
public:
	double                                        Acceleration;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_TransferAcceleration;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.TransferExplosionCount
// 0x0004 (0x0004 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_TransferExplosionCount final
{
public:
	int32                                         ExplosionCount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_TransferExplosionCount;

// Function Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle.Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C.TransferLoadedOreCount
// 0x0004 (0x0004 - 0x0000)
struct Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_TransferLoadedOreCount final
{
public:
	int32                                         LoadedOreCount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_CarryableContainer_MeteorDestroyer_Railgun_Receptacle_C_TransferLoadedOreCount;

}

