#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_VCChallengeReward

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_VCChallengeReward.Struct_VCChallengeReward
// 0x0028 (0x0028 - 0x0000)
struct FStruct_VCChallengeReward final
{
public:
	double                                        VerySmall_8_93D684F0414DD75F31B5C1B524457BFB;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Small_9_6649E7894048855518426BBADC985941;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Medium_12_18FC073E498ED957FD30F7B8E769A5B3;        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Large_14_68B657454615B694ED7D798AD0C5988A;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VeryLarge_16_72DCEC954EC40EEEB918B9B56F6A5AB6;     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_VCChallengeReward;

}

