#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Player_1st

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "GbxGame_structs.hpp"
#include "Engine_structs.hpp"
#include "BPAnim_Player_1st_structs.hpp"
#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Player_1st.BPAnim_Player_1st_C
// 0x21BE0 (0x23530 - 0x1950)
class UBPAnim_Player_1st_C final : public UOakCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct BPAnim_Player_1st::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;            // 0x1958(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1968(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_BlendSpaceGraph;            // 0x1970(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1978(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x1980(0x0E78)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_163;                // 0x27F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_162;                // 0x2828(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_161;                // 0x2858(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_160;                // 0x2888(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_159;                // 0x28B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_158;                // 0x28E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_157;                // 0x2918(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_156;                // 0x2948(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_155;                // 0x2978(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_154;                // 0x29A8(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_34;                      // 0x29D8(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_129;               // 0x2AA8(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_128;               // 0x2BA8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_96;                      // 0x2CA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_153;                // 0x2CD0(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_33;                      // 0x2D00(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_127;               // 0x2DD0(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_126;               // 0x2ED0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_95;                      // 0x2FD0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_32;                      // 0x2FF8(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_125;               // 0x30C8(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_124;               // 0x31C8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_94;                      // 0x32C8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_20;                     // 0x32F0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_93;                      // 0x33C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x33F0(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_92;                      // 0x3420(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_19;                     // 0x3448(0x00D8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x3520(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x35A8(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x3630(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_10;                     // 0x3660(0x0018)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17;                 // 0x3678(0x00F0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_123;               // 0x3768(0x0100)()
	struct FOakAnimNode_LimbTwist                 OakAnimGraphNode_LimbTwist;                        // 0x3868(0x0038)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_31;                      // 0x38A0(0x00D0)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_17;              // 0x3970(0x0108)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_16;              // 0x3A78(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_91;                      // 0x3B80(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_18;                     // 0x3BA8(0x00D8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_152;                // 0x3C80(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_151;                // 0x3CB0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_150;                // 0x3CE0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_149;                // 0x3D10(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_148;                // 0x3D40(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_147;                // 0x3D70(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_146;                // 0x3DA0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_145;                // 0x3DD0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_144;                // 0x3E00(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143;                // 0x3E30(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_142;                // 0x3E60(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_141;                // 0x3E90(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_140;                // 0x3EC0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_139;                // 0x3EF0(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x3F20(0x0050)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_122;               // 0x3F70(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_121;               // 0x4070(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_90;                      // 0x4170(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x4198(0x0050)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_120;               // 0x41E8(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_119;               // 0x42E8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89;                      // 0x43E8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x4410(0x0050)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_118;               // 0x4460(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_117;               // 0x4560(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_28;                    // 0x4660(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_116;               // 0x4730(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88;                      // 0x4830(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_9;                      // 0x4858(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87;                      // 0x4870(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_115;               // 0x4898(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86;                      // 0x4998(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_114;               // 0x49C0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_85;                      // 0x4AC0(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_8;                      // 0x4AE8(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84;                      // 0x4B00(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x4B28(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_27;                    // 0x4C00(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83;                      // 0x4CD0(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x4CF8(0x00D8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x4DD0(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x4E58(0x0088)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_113;               // 0x4EE0(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_30;                      // 0x4FE0(0x00D0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0x50B0(0x00F0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_29;                      // 0x51A0(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x5270(0x0088)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x52F8(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x53E8(0x0088)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_28;                      // 0x5470(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x5540(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x5570(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x56A8(0x0138)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_112;               // 0x57E0(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_111;               // 0x58E0(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_110;               // 0x59E0(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_109;               // 0x5AE0(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_108;               // 0x5BE0(0x0100)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0x5CE0(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x5D68(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x5DF0(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x5E78(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x5F00(0x0088)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_27;                      // 0x5F88(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x6058(0x0088)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_26;                    // 0x60E0(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x61B0(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x6238(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x6268(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x6298(0x0030)()
	struct FGbxAnimNode_LayeredBoneSetBlend       GbxAnimGraphNode_LayeredBoneSetBlend_1;            // 0x62C8(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138;                // 0x6410(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_137;                // 0x6440(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_136;                // 0x6470(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135;                // 0x64A0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134;                // 0x64D0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_133;                // 0x6500(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_132;                // 0x6530(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_131;                // 0x6560(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_130;                // 0x6590(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_129;                // 0x65C0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_128;                // 0x65F0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_127;                // 0x6620(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_126;                // 0x6650(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_125;                // 0x6680(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_124;                // 0x66B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x66E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x6710(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x6740(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x6770(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x67A0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x67D0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x6800(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x6830(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x6860(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x6890(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x68C0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x68F0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x6920(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x6950(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x6980(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x69B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x69E0(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_107;               // 0x6A10(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_82;                      // 0x6B10(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_106;               // 0x6B38(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_81;                      // 0x6C38(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_105;               // 0x6C60(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_104;               // 0x6D60(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_103;               // 0x6E60(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_25;                    // 0x6F60(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_26;                      // 0x7030(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x7100(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0x7128(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x7200(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x7228(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x7258(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x7288(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x72B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x72E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x7318(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_102;               // 0x7348(0x0100)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_1;               // 0x7448(0x0040)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_15;              // 0x7488(0x0108)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_101;               // 0x7590(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_17;           // 0x7690(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_100;               // 0x76B8(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_16;           // 0x77B8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_99;                // 0x77E0(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_15;           // 0x78E0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_98;                // 0x7908(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_14;           // 0x7A08(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_97;                // 0x7A30(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_13;           // 0x7B30(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_96;                // 0x7B58(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_12;           // 0x7C58(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_95;                // 0x7C80(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_11;           // 0x7D80(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_94;                // 0x7DA8(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_10;           // 0x7EA8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_93;                // 0x7ED0(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_9;            // 0x7FD0(0x0028)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph_1;                   // 0x7FF8(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_24;                    // 0x8068(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x8138(0x0050)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_92;                // 0x8188(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_8;            // 0x8288(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_91;                // 0x82B0(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_7;            // 0x83B0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_90;                // 0x83D8(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_6;            // 0x84D8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_89;                // 0x8500(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_5;            // 0x8600(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_88;                // 0x8628(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_4;            // 0x8728(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_87;                // 0x8750(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_3;            // 0x8850(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_86;                // 0x8878(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_2;            // 0x8978(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_85;                // 0x89A0(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_1;            // 0x8AA0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_84;                // 0x8AC8(0x0100)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult;              // 0x8BC8(0x0028)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph;                     // 0x8BF0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x8C60(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_14;              // 0x8C88(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x8D90(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_83;                // 0x8DB8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x8EB8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_82;                // 0x8EE0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x8FE0(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_13;              // 0x9008(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x9110(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0x9138(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x9210(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x9238(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x9268(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x9298(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x92C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x92F8(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_81;                // 0x9328(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_23;                    // 0x9428(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x94F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x9528(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x9558(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x9588(0x0030)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_12;              // 0x95B8(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x96C0(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_11;              // 0x96E8(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x97F0(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_10;              // 0x9818(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x9920(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0x9948(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x9A20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x9A48(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_80;                // 0x9A78(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x9B78(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_9;               // 0x9BA0(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x9CA8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0x9CD0(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0x9DA8(0x0028)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator_3;              // 0x9DD0(0x0088)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_22;                    // 0x9E58(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_79;                // 0x9F28(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0xA028(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_25;                      // 0xA050(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_78;                // 0xA120(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_77;                // 0xA220(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0xA320(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_24;                      // 0xA348(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_76;                // 0xA418(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_75;                // 0xA518(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0xA618(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_23;                      // 0xA640(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_74;                // 0xA710(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_73;                // 0xA810(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0xA910(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_22;                      // 0xA938(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_21;                      // 0xAA08(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_72;                // 0xAAD8(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_71;                // 0xABD8(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_70;                // 0xACD8(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_69;                // 0xADD8(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_21;                    // 0xAED8(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0xAFA8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0xAFD0(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_68;                // 0xB0A0(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_67;                // 0xB1A0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0xB2A0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_66;                // 0xB2C8(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0xB3C8(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_65;                // 0xB498(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0xB598(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0xB668(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_64;                // 0xB738(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_63;                // 0xB838(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0xB938(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_16;                      // 0xB960(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_15;                      // 0xBA30(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_62;                // 0xBB00(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_61;                // 0xBC00(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_60;                // 0xBD00(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_20;                    // 0xBE00(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_59;                // 0xBED0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0xBFD0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_14;                      // 0xBFF8(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_58;                // 0xC0C8(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_57;                // 0xC1C8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0xC2C8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_13;                      // 0xC2F0(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_56;                // 0xC3C0(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_55;                // 0xC4C0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0xC5C0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_12;                      // 0xC5E8(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_54;                // 0xC6B8(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_53;                // 0xC7B8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0xC8B8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0xC8E0(0x00F0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_52;                // 0xC9D0(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_19;                    // 0xCAD0(0x00D0)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator_2;              // 0xCBA0(0x0088)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_51;                // 0xCC28(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_18;                    // 0xCD28(0x00D0)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_8;               // 0xCDF8(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0xCF00(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0xCF28(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0xD000(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0xD030(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0xD0B8(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_7;                      // 0xD0E8(0x0018)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0xD100(0x00F0)()
	struct FOakAnimNode_ArmIK                     OakAnimGraphNode_ArmIK;                            // 0xD1F0(0x0A50)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_50;                // 0xDC40(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0xDD40(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0xDD70(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_49;                // 0xDDA0(0x0100)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0xDEA0(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0xDF28(0x0030)()
	uint8                                         Pad_DF58[0x8];                                     // 0xDF58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0xDF60(0x0550)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_17;                    // 0xE4B0(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0xE580(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0xE5B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0xE5E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0xE610(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0xE640(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0xE670(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0xE6A0(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_6;                      // 0xE6D0(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0xE6E8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_48;                // 0xE710(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0xE810(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_47;                // 0xE838(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0xE938(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_5;                      // 0xE960(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0xE978(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0xE9A0(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0xEA78(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_11;                      // 0xEAA8(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_10;                      // 0xEB78(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0xEC48(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0xEC78(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0xECA8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0xECD8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0xED08(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0xED38(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0xED68(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0xED98(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_46;                // 0xEDC8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0xEEC8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_45;                // 0xEEF0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0xEFF0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_44;                // 0xF018(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0xF118(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_43;                // 0xF140(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0xF240(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_4;                      // 0xF268(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0xF280(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0xF2A8(0x00D8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_16;                    // 0xF380(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0xF450(0x0E78)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x102C8(0x0E78)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x11140(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x11170(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x111F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0x11228(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0x11258(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0x11288(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0x112B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x112E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x11318(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x11348(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_42;                // 0x11378(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x11478(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_41;                // 0x114A0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x115A0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_40;                // 0x115C8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x116C8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_39;                // 0x116F0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x117F0(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3;                      // 0x11818(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x11830(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x11858(0x00D8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_7;               // 0x11930(0x0108)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_15;                    // 0x11A38(0x00D0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x11B08(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x11BF8(0x0E78)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9;                       // 0x12A70(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x12B40(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x12B70(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x12BA0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x12BD0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x12C00(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x12C30(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x12C60(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x12C90(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x12CC0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x12CF0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x12D20(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x12D50(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x12D80(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x12DB0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x12DE0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x12E10(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_38;                // 0x12E40(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x12F40(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_6;               // 0x12F68(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x13070(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_37;                // 0x13098(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x13198(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x131C0(0x00F0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x132B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x132E0(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_36;                // 0x13310(0x0100)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_5;               // 0x13410(0x0108)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_14;                    // 0x13518(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x135E8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_35;                // 0x13610(0x0100)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_4;               // 0x13710(0x0108)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_13;                    // 0x13818(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x138E8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x13910(0x00D8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_34;                // 0x139E8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x13AE8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x13B10(0x00F0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x13C00(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x13C30(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_33;                // 0x13C60(0x0100)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_3;               // 0x13D60(0x0108)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_12;                    // 0x13E68(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x13F38(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_32;                // 0x13F60(0x0100)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_2;               // 0x14060(0x0108)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_11;                    // 0x14168(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x14238(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x14260(0x00D8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x14338(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_31;                // 0x14368(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x14468(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_30;                // 0x14490(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x14590(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x145B8(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x14690(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x146B8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x146E8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x14710(0x00D8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x147E8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x14810(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_29;                // 0x14838(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x14938(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x14968(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x149B8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x14AA8(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x14AD8(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x14B60(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x14B90(0x0E78)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x15A08(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x15A90(0x0088)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x15B18(0x00F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10;                    // 0x15C08(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x15CD8(0x0E78)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x16B50(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x16B80(0x0E78)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x179F8(0x0018)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x17A10(0x0030)()
	struct FOakAnimNode_FirstPerson               OakAnimGraphNode_FirstPerson;                      // 0x17A40(0x00E8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x17B28(0x0028)()
	struct FGbxAnimNode_LayeredBoneSetBlend       GbxAnimGraphNode_LayeredBoneSetBlend;              // 0x17B50(0x0148)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x17C98(0x0E78)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x18B10(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x18C00(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x18C88(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x18D10(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x18D40(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x18D70(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_28;                // 0x18DA0(0x0100)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x18EA0(0x0E78)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x19D18(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x19DA0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x19DD0(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x19E00(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x19EF0(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x19F20(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x1A010(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x1A098(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x1A0C8(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x1A150(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x1A180(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_8;                       // 0x1A1B0(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1A280(0x0E78)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x1B0F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x1B128(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x1B158(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1B188(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x1B1B8(0x0030)()
