#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Player_StandIn

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "GbxGame_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FaceFX_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Player_StandIn.BPAnim_Player_StandIn_C
// 0x5480 (0x6DD0 - 0x1950)
class UBPAnim_Player_StandIn_C final : public UOakCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1958(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1960(0x0008)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1968(0x0018)()
	struct FGbxAnimNode_RandomOverride            GbxAnimGraphNode_RandomOverride_1;                 // 0x1980(0x02C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1C48(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1D18(0x0E78)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2B90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2BB8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x2BE8(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2C18(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2CA0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2CD0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2D00(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x2D30(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2D60(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x2D90(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x2DC0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2DF0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2E20(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2E50(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2E80(0x0030)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_6;                 // 0x2EB0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2FB0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_5;                 // 0x2FD8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x30D8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_4;                 // 0x3100(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x3200(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_3;                 // 0x3228(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x3328(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_2;                 // 0x3350(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x3450(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_1;                 // 0x3478(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x3578(0x0028)()
	struct FGbxAnimNode_RandomOverride            GbxAnimGraphNode_RandomOverride;                   // 0x35A0(0x02C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer;                   // 0x3868(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x3968(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x3990(0x00D8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x3A68(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3A90(0x0028)()
	struct FAnimNode_BlendFaceFXAnimation         AnimGraphNode_BlendFaceFXAnimation;                // 0x3AB8(0x0088)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x3B40(0x04E8)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x4028(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x4118(0x0E78)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x4F90(0x0088)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x5018(0x0E78)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x5E90(0x0E78)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x6D08(0x0088)()
	int32                                         Temp_WeaponState;                                  // 0x6D90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weap_ADSexit_none;                                 // 0x6D94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weap_ADSenter_none;                                // 0x6D95(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weap_HasADSPose;                                   // 0x6D96(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weap_HasBodyPose;                                  // 0x6D97(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeapHasForegripPose;                               // 0x6D98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeapHasGripPose;                                   // 0x6D99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9A[0x2];                                     // 0x6D9A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Delta_Time_X;                                      // 0x6D9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBackward;                                       // 0x6DA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_slots_Active_AllOffhand;                 // 0x6DA1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DA2[0x6];                                     // 0x6DA2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LandVelocityAbs;                                   // 0x6DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FallPlayRate;                                      // 0x6DB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngularVel;                                        // 0x6DB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_is_in_ffyl;                              // 0x6DBC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_att_exo_auto_lock_active;                // 0x6DBD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_vehicle_is_airborne;                     // 0x6DBE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DBF[0x1];                                     // 0x6DBF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ATTRIBUTE_vehicle_ground_alpha;                    // 0x6DC0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_slot_active_mode_offhand;                // 0x6DC4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_att_exo_buster_active;                   // 0x6DC5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_weapon_type_heavy;                       // 0x6DC6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC7[0x1];                                     // 0x6DC7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ATTRIBUTE_can_use_weapon_while_sprinting;          // 0x6DC8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_att_exo_heavy_arms_active;               // 0x6DCC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NOTConfimed___NOTSelected;                         // 0x6DCD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_OnIdleConfirmed();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void ExecuteUbergraph_BPAnim_Player_StandIn(int32 entrypoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPAnim_Player_StandIn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPAnim_Player_StandIn_C")
	}
	static class UBPAnim_Player_StandIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_Player_StandIn_C>();
	}
};
DUMPER7_ASSERTS_UBPAnim_Player_StandIn_C;

}

