#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhotoMode

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class PhotoMode.KPhotoModePawn
// 0x0340 (0x0790 - 0x0450)
class AKPhotoModePawn final : public ADefaultPawn
{
public:
	class APawn*                                  OriginalPlayerPawn;                                // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UKPhotoModeSubsystem*                   PhotoModeSubsystem;                                // 0x0458(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UCineCameraComponent*                   CineCameraComp;                                    // 0x0460(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UTimelineComponent*                     StartTimelineComp;                                 // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UTimelineComponent*                     EndTimelineComp;                                   // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          bIsTransitioning;                                  // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_479[0x27];                                     // 0x0479(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PM_PlayerTags;                                     // 0x04A0(0x0020)(NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  PM_EnemyTags;                                      // 0x04C0(0x0020)(NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  PM_NpcTags;                                        // 0x04E0(0x0020)(NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  PM_SummonExcludeTags;                              // 0x0500(0x0020)(NativeAccessSpecifierPrivate)
	TArray<class FString>                         PM_ExcludedMeshList;                               // 0x0520(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FString>                         PM_ExcludedNiagaraList;                            // 0x0530(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FString>                         PM_IncludedInteractiveObjectList;                  // 0x0540(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         MaxDistance;                                       // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ExitDistance;                                      // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UCurveFloat>             FloatCurve;                                        // 0x0558(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FilterWeight;                                      // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InitialTimeOfDay;                                  // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanSetTimeOfDay;                                  // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDamageNumbersAreVisible;                          // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlayerIsVisibility;                               // 0x058A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSummonIsVisibility;                               // 0x058B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bNpcIsVisibility;                                  // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnemyIsVisibility;                                // 0x058D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58E[0x2];                                      // 0x058E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxStartOffset;                                    // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinStartOffset;                                    // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BoundsForce;                                       // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSkipStart;                                        // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59D[0x3];                                      // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x05A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               SpawnRotator;                                      // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                                StartLocation;                                     // 0x0618(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               StartRotator;                                      // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                                EndLocation;                                       // 0x0648(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               EndRotator;                                        // 0x0660(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                                ExitLocation;                                      // 0x0678(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                               ExitRotator;                                       // 0x0690(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	TDelegate<void(float Output)>                 StartFloatUpdate;                                  // 0x06A8(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void()>                             StartFinishEvent;                                  // 0x06B8(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(float Output)>                 EndFloatUpdate;                                    // 0x06C8(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void()>                             EndFinishEvent;                                    // 0x06D8(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AGbxCharacter>>   HiddenPlayerCharacters;                            // 0x06E8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AGbxCharacter>>   HiddenSummons;                                     // 0x06F8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AGbxCharacter>>   HiddenNPC;                                         // 0x0708(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AGbxDecoCharacter>> HiddenDecoCharacters;                            // 0x0718(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AGbxCharacter>>   HiddenEnemies;                                     // 0x0728(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AInteractiveObject>> HiddenEnemyInteractiveObjects;                  // 0x0738(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class APawn>>           HiddenPlayerVehicles;                              // 0x0748(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AGbxDrone>>       HiddenDrones;                                      // 0x0758(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_768[0x28];                                     // 0x0768(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivatePhotoModePawn(class APlayerController* InPlayerController);
	void DeactivatePhotoModePawn();
	void EnableFocusOverride(bool bIsEnable);
	struct FVector FindStartLocation(const struct FVector& InLocation);
	TArray<class UMeshComponent*> GetAllMeshComponents(const class AActor* InActor);
	TArray<class UNiagaraComponent*> GetAllNiagaraComponents(const class AActor* InActor);
	float GetDistanceToPlayerCharacter();
	bool IsToggleableInteractiveObject(const class AActor* InteractiveObject);
	void KeepWithinRadius();
	void OnEndTimelineFinished();
	void OnEndTimelineUpdate(float ALPHA);
	void OnStartTimelineFinished();
	void OnStartTimelineUpdate(float ALPHA);
	void SetActorVisibility(class AActor* InActor, bool bIsVisible);
	void SetBloom(float InBloomIntensity);
	void SetChromaticAberration(float InChromaticAberrationIntensity);
	void SetDamageNumbersVisibility(bool bIsVisible);
	void SetEnemyVisibility(bool bIsVisible);
	void SetExposure(float InExposure);
	void SetFilmGrain(float InGrain);
	void SetFilter(const class FString& InFilterName);
	void SetFilterByIndex(int32 InFilterIndex);
	void SetFilterIntensity(float InIntensity);
	void SetFocusDistance(float InFocusDistance);
	void SetFocusRegion(float InFocusRegion);
	void SetLensFlare(float InLensFlareIntensity);
	void SetNPCVisibility(bool bIsVisible);
	void SetPhotoModeFOV(float InFOV);
	void SetPhotoModeRoll(float InRoll);
	void SetPlayerAnimIdent(const class FString& inAnimIdent);
	void SetPlayerCharacterVisibility(bool bIsVisible);
	void SetScreenContrast(float InContrast);
	void SetScreenGain(float InGain);
	void SetScreenGamma(float InGamma);
	void SetScreenSaturation(float InSaturation);
	void SetSpawnParams();
	void SetSummonVisibility(bool bIsVisible);
	void SetTimeOfDay(float InTOD);
	void SetVignetteIntensity(float InIntensity);
	class AController* TryGetLocalController();
	void UpdateDamageNumbersVisibility();

	struct FVector GetHeadBoneLocation() const;
	void SetCameraViewportSize() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KPhotoModePawn")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KPhotoModePawn")
	}
	static class AKPhotoModePawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKPhotoModePawn>();
	}
};
DUMPER7_ASSERTS_AKPhotoModePawn;

// Class PhotoMode.KPhotoModeSettings
// 0x0328 (0x0360 - 0x0038)
class UKPhotoModeSettings final : public UDeveloperSettings
{
public:
	float                                         maxspeed;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Deceleration;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurningBoost;                                      // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExitDistance;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoundsForce;                                       // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveFloat>             MovementCurve;                                     // 0x0058(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionRadius;                                   // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UInputMappingContext>    PhotoModeInputMapping;                             // 0x0088(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            MoveCameraInput;                                   // 0x00B0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            LookCameraInput;                                   // 0x00D8(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            RaiseCameraInput;                                  // 0x0100(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            LowerCameraInput;                                  // 0x0128(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            ToggleUIInput;                                     // 0x0150(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            TogglePauseInput;                                  // 0x0178(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            ResetSettingsInput;                                // 0x01A0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            ResetPositionInput;                                // 0x01C8(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            CloseInput;                                        // 0x01F0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            TabLeftInput;                                      // 0x0218(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            TabRightInput;                                     // 0x0240(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UInputAction>            ModifySelectionInput;                              // 0x0268(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UTexture>>        FilterLUTs;                                        // 0x0290(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UAnimationAsset>> AnimationPoses;                                    // 0x02A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlayerTags;                                        // 0x02B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  EnemyTags;                                         // 0x02D0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  NpcTags;                                           // 0x02F0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  SummonExcludeTags;                                 // 0x0310(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         MeshList;                                          // 0x0330(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         NiagaraList;                                       // 0x0340(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         InteractiveObjectList;                             // 0x0350(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KPhotoModeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KPhotoModeSettings")
	}
	static class UKPhotoModeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKPhotoModeSettings>();
	}
};
DUMPER7_ASSERTS_UKPhotoModeSettings;

// Class PhotoMode.KPhotoModeSubsystem
// 0x00C0 (0x00F0 - 0x0030)
class UKPhotoModeSubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0xC0];                                      // 0x0030(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AreFiltersValid();
	class AActor* GetActiveViewTarget();
	class UAnimationAsset* GetAnimationAssetByName(const class FString& assetname);
	class UTexture* GetFilterLUTByIndex(const int32 FilterIndex);
	class UCurveFloat* GetFloatCurve();
	class UInputMappingContext* GetInputMappingContext();
	TArray<class FString> GetLUTAssetNames();
	class UTexture* GetLUTByAssetName(const class FString& FilterName);
	class UTexture* GetLUTByFilterName(const class FString& FilterName);
	void GetTransformOffset(class AGbxPlayerController* InOriginPlayerController, struct FVector* OutLocation, struct FRotator* OutRotation);
	void GetTransformOffsetFromOrigin(struct FVector* OutLocation, struct FRotator* OutRotation);
	void LockOriginalPlayerCharacter(class AGbxCharacter* PlayerCharacter);
	void RemoveFilterLUT();
	void RemoveFloatCurve();
	void RemoveInputMappingContext();
	void RemovePoseAnimations();
	void RevertToPreviousViewTarget();
	void UnlockOriginalPlayerCharacter(class AGbxCharacter* PlayerCharacter);

	const class UKPhotoModeSettings* GetOrSetPhotoModeSettings() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KPhotoModeSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KPhotoModeSubsystem")
	}
	static class UKPhotoModeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKPhotoModeSubsystem>();
	}
};
DUMPER7_ASSERTS_UKPhotoModeSubsystem;

}

