#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_io_CreatureCage

#include "Basic.hpp"

#include "GbxGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK::Params
{

// Function Script_io_CreatureCage.Script_io_CreatureCage_C.damageable__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_io_CreatureCage_C_damageable__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_io_CreatureCage_C_damageable__OnStateEnabled;

// Function Script_io_CreatureCage.Script_io_CreatureCage_C.destroyed__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_io_CreatureCage_C_destroyed__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_io_CreatureCage_C_destroyed__OnStateEnabled;

// Function Script_io_CreatureCage.Script_io_CreatureCage_C.ExecuteUbergraph_Script_io_CreatureCage
// 0x04A0 (0x04A0 - 0x0000)
struct Script_io_CreatureCage_C_ExecuteUbergraph_Script_io_CreatureCage final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable;                              // 0x0004(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_1;                            // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_2;                            // 0x001C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActorStateAsBool_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorStateAsBool_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_2;                      // 0x002C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_3;                            // 0x003C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_4;                            // 0x0048(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_1;                      // 0x0054(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState;                        // 0x0064(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_5;                            // 0x0074(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_6;                            // 0x0080(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue;         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_1;              // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_1;       // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamageReceiver;                       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_Event_Details;                              // 0x0098(0x0140)(ConstParm, ContainsInstancedReference)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_7;                            // 0x01D8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          CallFunc_GetActorState_ReturnValue;                // 0x01E8(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_DynamicCast_AsOak_Player_Controller;        // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_GbxActorStateMachineStateKey_Name_ReturnValue; // 0x0204(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_8;                            // 0x0210(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_9;                            // 0x021C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_10;                           // 0x0228(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_2;              // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_11;                           // 0x0238(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_3;              // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_4;                      // 0x0248(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_4;                    // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumAliveActors_ReturnValue;            // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_12;                           // 0x0260(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpawner*                               K2Node_CustomEvent_Spawner;                        // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          CallFunc_GetActorState_ReturnValue_1;              // 0x0278(0x000C)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_GbxActorStateMachineStateKey_Name_ReturnValue_1; // 0x0284(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ASpawner* Spawner)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpawner*                               K2Node_CustomEvent_Spawner_1;                      // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HaveAllSpawned_ReturnValue;               // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpawnerComponent*                      CallFunc_GetSpawnerComponent_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpawnerEnabled_ReturnValue;             // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_2;       // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class Ainteractivedamageable*                 CallFunc_GetAssociatedActor_ReturnValue;           // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_5;                      // 0x02C8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_5;                    // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D6[0x2];                                      // 0x02D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_13;                           // 0x02D8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_4;              // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class Ainteractivedamageable*                 CallFunc_GetAssociatedActor_ReturnValue_1;         // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_6;                      // 0x02F0(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_6;                    // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FF[0x1];                                      // 0x02FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class Ainteractivedamageable*                 CallFunc_GetAssociatedActor_ReturnValue_2;         // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_7;                      // 0x0308(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_7;                    // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_316[0x2];                                      // 0x0316(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class Ainteractivedamageable*                 CallFunc_GetAssociatedActor_ReturnValue_3;         // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_DamageReceiver;    // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_GbxActorScriptBoundEvent_Details;           // 0x0328(0x0140)(ConstParm, ContainsInstancedReference)
	TDelegate<void(class ASpawner* Spawner, class AActor* Actor)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0468(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x3];                                      // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_3;                      // 0x047C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_3;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_io_CreatureCage_C_ExecuteUbergraph_Script_io_CreatureCage;

// Function Script_io_CreatureCage.Script_io_CreatureCage_C.GbxActorScriptEvt__DamageState_OnTakeAnyDamage
// 0x0148 (0x0148 - 0x0000)
struct Script_io_CreatureCage_C_GbxActorScriptEvt__DamageState_OnTakeAnyDamage final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0008(0x0140)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Script_io_CreatureCage_C_GbxActorScriptEvt__DamageState_OnTakeAnyDamage;

// Function Script_io_CreatureCage.Script_io_CreatureCage_C.immune__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_io_CreatureCage_C_immune__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_io_CreatureCage_C_immune__OnStateEnabled;

// Function Script_io_CreatureCage.Script_io_CreatureCage_C.RemoveFogWall
// 0x0008 (0x0008 - 0x0000)
struct Script_io_CreatureCage_C_RemoveFogWall final
{
public:
	class ASpawner*                               Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_io_CreatureCage_C_RemoveFogWall;

// Function Script_io_CreatureCage.Script_io_CreatureCage_C.SetUpSpawnedAI
// 0x0028 (0x0028 - 0x0000)
struct Script_io_CreatureCage_C_SetUpSpawnedAI final
{
public:
	class ASpawner*                               Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      NoneCheck;                                         // 0x0010(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_io_CreatureCage_C_SetUpSpawnedAI;

// Function Script_io_CreatureCage.Script_io_CreatureCage_C.spawning__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_io_CreatureCage_C_spawning__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_io_CreatureCage_C_spawning__OnStateEnabled;

// Function Script_io_CreatureCage.Script_io_CreatureCage_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct Script_io_CreatureCage_C_UserConstructionScript final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable;                              // 0x000C(0x000C)(NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetBodyComponent_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_GetBodyComponent_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActorStateAsBool_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_io_CreatureCage_C_UserConstructionScript;

}

