#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_SpawnMesh_MoonPod

#include "Basic.hpp"

#include "GbxEngine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxGame_structs.hpp"


namespace SDK::Params
{

// Function Script_SpawnMesh_MoonPod.Script_SpawnMesh_MoonPod_C.ExecuteUbergraph_Script_SpawnMesh_MoonPod
// 0x0170 (0x0170 - 0x0000)
struct Script_SpawnMesh_MoonPod_C_ExecuteUbergraph_Script_SpawnMesh_MoonPod final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakSpawnPoint*                         CallFunc_GetAssociatedActor_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState;                        // 0x0028(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageTags                            Temp_struct_Variable;                              // 0x0038(0x0020)(ConstParm)
	struct FHitResult                             Temp_struct_Variable_1;                            // 0x0058(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_1;                      // 0x0158(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_1;                    // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakSpawnPoint*                         CallFunc_GetAssociatedActor_ReturnValue_1;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_SpawnMesh_MoonPod_C_ExecuteUbergraph_Script_SpawnMesh_MoonPod;

// Function Script_SpawnMesh_MoonPod.Script_SpawnMesh_MoonPod_C.IsSpawning__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_SpawnMesh_MoonPod_C_IsSpawning__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_SpawnMesh_MoonPod_C_IsSpawning__OnStateEnabled;

// Function Script_SpawnMesh_MoonPod.Script_SpawnMesh_MoonPod_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct Script_SpawnMesh_MoonPod_C_UserConstructionScript final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable;                              // 0x0008(0x000C)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_BoolToName_ReturnValue;              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakSpawnPoint*                         CallFunc_GetAssociatedActor_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          CallFunc_Conv_Name_GbxActorStateMachineStateKey_ReturnValue; // 0x0028(0x000C)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_SpawnMesh_MoonPod_C_UserConstructionScript;

}

