#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_IO_ExplodingObject_MissileBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxGame_structs.hpp"


namespace SDK::Params
{

// Function Script_IO_ExplodingObject_MissileBox.Script_IO_ExplodingObject_MissileBox_C.damageable__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_MissileBox_C_damageable__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_MissileBox_C_damageable__OnStateEnabled;

// Function Script_IO_ExplodingObject_MissileBox.Script_IO_ExplodingObject_MissileBox_C.ExecuteUbergraph_Script_IO_ExplodingObject_MissileBox
// 0x0698 (0x0698 - 0x0000)
struct Script_IO_ExplodingObject_MissileBox_C_ExecuteUbergraph_Script_IO_ExplodingObject_MissileBox final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_DamageReceiver;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_GbxActorScriptBoundEvent_Details;           // 0x0010(0x0140)(ConstParm, ContainsInstancedReference)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_1;                      // 0x0150(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_1;                    // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState;                        // 0x0160(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState;                      // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable;                              // 0x0170(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_1;                            // 0x017C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue;                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_1;       // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B[0x1];                                      // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_2;                            // 0x018C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_3;                            // 0x0198(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_4;                            // 0x01A4(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_1;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_5;                            // 0x01B4(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_2;       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_2;              // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamageReceiver_1;                     // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_3;       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageReceiver;                       // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_Event_Details;                              // 0x01F0(0x0140)(ConstParm, ContainsInstancedReference)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_6;                            // 0x0330(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_7;                            // 0x033C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable_8;                            // 0x0348(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetActorState_ReturnValue_3;              // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_3;                      // 0x044C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_3;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakInteractiveObject*                  CallFunc_GetAssociatedActor_ReturnValue;           // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AOakInteractiveObject*                  CallFunc_GetAssociatedActor_ReturnValue_1;         // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable_9;                            // 0x0470(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FDamageTags                            Temp_struct_Variable_10;                           // 0x0570(0x0020)(ConstParm)
	struct FFactAddress                           Temp_struct_Variable_11;                           // 0x0590(0x0038)(ConstParm, HasGetValueTypeHash)
	struct FDamageTags                            Temp_struct_Variable_12;                           // 0x05C8(0x0020)(ConstParm)
	class UFactHandle*                            CallFunc_ReadFactGetHandle_FactHandle;             // 0x05E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFactHandleAsInt32_ReturnValue;         // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x05F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5[0x3];                                      // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakInteractiveObject*                  CallFunc_GetAssociatedActor_ReturnValue_2;         // 0x0600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakInteractiveObject*                  CallFunc_GetAssociatedActor_ReturnValue_3;         // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_4;                      // 0x0638(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_4;                    // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_645[0x3];                                      // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_5;                      // 0x0648(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_5;                    // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_655[0x3];                                      // 0x0655(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      CallFunc_GetBodyComponent_ReturnValue;             // 0x0658(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AOakInteractiveObject*                  CallFunc_GetAssociatedActor_ReturnValue_4;         // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetBodyComponent_ReturnValue_1;           // 0x0668(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_2;                      // 0x0670(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_2;                    // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_DamageReceiver_1;  // 0x0680(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_DamageCauser;      // 0x0688(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_MissileBox_C_ExecuteUbergraph_Script_IO_ExplodingObject_MissileBox;

// Function Script_IO_ExplodingObject_MissileBox.Script_IO_ExplodingObject_MissileBox_C.Exploded__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_MissileBox_C_Exploded__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_MissileBox_C_Exploded__OnStateEnabled;

// Function Script_IO_ExplodingObject_MissileBox.Script_IO_ExplodingObject_MissileBox_C.Exploding__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_MissileBox_C_Exploding__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_MissileBox_C_Exploding__OnStateEnabled;

// Function Script_IO_ExplodingObject_MissileBox.Script_IO_ExplodingObject_MissileBox_C.GbxActorScriptEvt__DamageState_OnHealthDepleted
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_MissileBox_C_GbxActorScriptEvt__DamageState_OnHealthDepleted final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_MissileBox_C_GbxActorScriptEvt__DamageState_OnHealthDepleted;

// Function Script_IO_ExplodingObject_MissileBox.Script_IO_ExplodingObject_MissileBox_C.GbxActorScriptEvt__DamageState_OnTakeAnyDamage
// 0x0148 (0x0148 - 0x0000)
struct Script_IO_ExplodingObject_MissileBox_C_GbxActorScriptEvt__DamageState_OnTakeAnyDamage final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0008(0x0140)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_MissileBox_C_GbxActorScriptEvt__DamageState_OnTakeAnyDamage;

// Function Script_IO_ExplodingObject_MissileBox.Script_IO_ExplodingObject_MissileBox_C.LaunchExplodingObject
// 0x00D8 (0x00D8 - 0x0000)
struct Script_IO_ExplodingObject_MissileBox_C_LaunchExplodingObject final
{
public:
	struct FVector                                ThrowVector;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        force;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        X;                                                 // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Y;                                                 // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Z;                                                 // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Additive_Vector;                                   // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable;                              // 0x0050(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_1;                            // 0x0090(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_MissileBox_C_LaunchExplodingObject;

}

