#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_IO_ExplodingObject_Missile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxGame_structs.hpp"


namespace SDK::Params
{

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.damageable__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_damageable__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_damageable__OnStateEnabled;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.ExecuteUbergraph_Script_IO_ExplodingObject_Missile
// 0x08B8 (0x08B8 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_ExecuteUbergraph_Script_IO_ExplodingObject_Missile final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObjectContainer*              K2Node_GbxActorScriptBoundEvent_Container;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_LastCarrier;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFactAddress                           Temp_struct_Variable;                              // 0x0018(0x0038)(ConstParm, HasGetValueTypeHash)
	struct FDamageTags                            Temp_struct_Variable_1;                            // 0x0050(0x0020)(ConstParm)
	struct FHitResult                             Temp_struct_Variable_2;                            // 0x0070(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UFactHandle*                            CallFunc_ReadFactGetHandle_FactHandle;             // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_1;                      // 0x0178(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_1;                    // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFactHandleAsInt32_ReturnValue;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_3;                            // 0x018C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_4;                            // 0x0198(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue;         // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue;                // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamageReceiver;                       // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_Event_Details;                              // 0x01B0(0x0140)(ConstParm, ContainsInstancedReference)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_5;                            // 0x02F0(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue;       // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_6;                            // 0x0308(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_7;                            // 0x0314(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_1;              // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_8;                            // 0x0324(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState;                        // 0x0330(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState;                      // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_9;                            // 0x0340(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_2;              // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_10;                           // 0x0350(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_1;       // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_3;              // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_2;       // 0x035E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35F[0x1];                                      // 0x035F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_User;                                 // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUsabilityType                                K2Node_Event_UseType;                              // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasHeld;                             // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_3;       // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Carrier_2;                            // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetAssociatedCharacter_ReturnValue_1;     // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_4;       // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Carrier_1;                            // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_5;       // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_11;                           // 0x03AC(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_12;                           // 0x03B8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_6;       // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_4;              // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C6[0x2];                                      // 0x03C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OverlappedActor;                      // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_13;                           // 0x03D8(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F3[0x1];                                      // 0x03F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_14;                           // 0x03F4(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_7;       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_5;              // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Carrier;                              // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_8;       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObjectContainer*              K2Node_Event_Container;                            // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_LastCarrier;                          // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_3;                      // 0x0428(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_3;                    // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0436(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0437(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A[0x2];                                      // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_15;                           // 0x043C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue;           // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Temp_struct_Variable_16;                           // 0x0458(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0578(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0590(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_1;         // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x05B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x05C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_4;                      // 0x05E0(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_4;                    // 0x05EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ED[0x3];                                      // 0x05ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_2;         // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_17;                           // 0x05F8(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageTags                            Temp_struct_Variable_18;                           // 0x0608(0x0020)(ConstParm)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_2;                      // 0x0628(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_2;                    // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_6;              // 0x0635(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_636[0x2];                                      // 0x0636(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_5;                      // 0x0648(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_5;                    // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_655[0x3];                                      // 0x0655(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_3;         // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_4;         // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ForceDropCarriedObject_Success;           // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67A[0x2];                                      // 0x067A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateMachineKey               Temp_struct_Variable_19;                           // 0x067C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_20;                           // 0x0688(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue_7;              // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_5;         // 0x06A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_6;         // 0x06B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_6;                      // 0x06B8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_6;                    // 0x06C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5[0x3];                                      // 0x06C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_7;         // 0x06E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_DamageReceiver;    // 0x06F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_GbxActorScriptBoundEvent_Details;           // 0x06F8(0x0140)(ConstParm, ContainsInstancedReference)
	struct FGbxActorStateMachineStateKey          K2Node_Event_PreviousState_7;                      // 0x0838(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialState_7;                    // 0x0844(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_845[0x3];                                      // 0x0845(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_User;              // 0x0848(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUsabilityType                                K2Node_GbxActorScriptBoundEvent_UseType;           // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_GbxActorScriptBoundEvent_bWasHeld;          // 0x0851(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_852[0x6];                                      // 0x0852(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_8;         // 0x0858(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_Carrier;           // 0x0860(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_GetBodyComponent_ReturnValue;             // 0x0868(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_Carrier_1;         // 0x0870(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_9;         // 0x0878(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_OverlappedActor;   // 0x0880(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_OtherActor;        // 0x0888(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_891[0x7];                                      // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_Carrier_2;         // 0x0898(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_FuseTime_ImplicitCast;          // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x08B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_ExecuteUbergraph_Script_IO_ExplodingObject_Missile;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.Exploded__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_Exploded__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_Exploded__OnStateEnabled;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.Exploding__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_Exploding__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_Exploding__OnStateEnabled;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.Flying__OnStateEnabled
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_Flying__OnStateEnabled final
{
public:
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialState;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_Flying__OnStateEnabled;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.GbxActorScriptEvt__DamageState_OnTakeAnyDamage
// 0x0148 (0x0148 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__DamageState_OnTakeAnyDamage final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0008(0x0140)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__DamageState_OnTakeAnyDamage;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.GbxActorScriptEvt__OnActorBeginOverlap
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnActorBeginOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnActorBeginOverlap;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.GbxActorScriptEvt__OnCarried
// 0x0008 (0x0008 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnCarried final
{
public:
	class AActor*                                 Carrier;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnCarried;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.GbxActorScriptEvt__OnPlacedInContainer
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnPlacedInContainer final
{
public:
	class ACarryableObjectContainer*              Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LastCarrier;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnPlacedInContainer;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.GbxActorScriptEvt__OnThrown
// 0x0008 (0x0008 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnThrown final
{
public:
	class AActor*                                 Carrier;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnThrown;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.GbxActorScriptEvt__OnUncarried
// 0x0008 (0x0008 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnUncarried final
{
public:
	class AActor*                                 Carrier;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__OnUncarried;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.GbxActorScriptEvt__UsableActorState_K2_OnUsed
// 0x0010 (0x0010 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__UsableActorState_K2_OnUsed final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUsabilityType                                UseType;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasHeld;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_GbxActorScriptEvt__UsableActorState_K2_OnUsed;

// Function Script_IO_ExplodingObject_Missile.Script_IO_ExplodingObject_Missile_C.LaunchExplodingObject
// 0x0070 (0x0070 - 0x0000)
struct Script_IO_ExplodingObject_Missile_C_LaunchExplodingObject final
{
public:
	struct FVector                                ThrowVector;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        force;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        X;                                                 // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Y;                                                 // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Z;                                                 // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Additive_Vector;                                   // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable;                              // 0x0050(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable_1;                            // 0x005C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_ExplodingObject_Missile_C_LaunchExplodingObject;

}

