#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ShieldTest_2

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ShieldTest_2.Struct_ShieldTest_2
// 0x0050 (0x0050 - 0x0000)
struct FStruct_ShieldTest_2 final
{
public:
	class FString                                 Comment_1_94_375CD4C34016E17B2FE8198AAA51209F;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Augment_Secondary_78_69E441E543482BCED8E266B8CA41F7DE; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Augment_Primary_56_353F09AC41355301655987A4F18E57F5; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Augment_Both_81_CE5263F94EBD11DDDC87428CDB32F99A;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Comment_2_95_B5BA8C584C777BB86C62AD9C2A422618;     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Augment_Secondary_2_96_0608396B4FCD88C5AD645B82A8827B25; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Augment_Primary_2_97_3BAEBD9D419DE056195974A14DC05722; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Augment_Both_2_98_3AE920C6426F128CA11D7FA72DB3AF93; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_ShieldTest_2;

}

