#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Robo_Totem_Balance

#include "Basic.hpp"

#include "Enum_Robo_Cleromancy_Dolltype_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Robo_Totem_Balance.Struct_Robo_Totem_Balance
// 0x0080 (0x0080 - 0x0000)
struct FStruct_Robo_Totem_Balance final
{
public:
	Enum_Robo_Cleromancy_Dolltype                 Type_28_1D7186834952E1B2D42D218C458F119E;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Roll_31_3EB482FF4ADB430E8AD8B483A711EC4E;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lifespan_2_81112EE447D9A3973F5C329207AA71C5;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseAttackCooldown_4_6275D30C45407106796468BC215CF0C0; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpecialAttackCooldown_6_CE0AF8524A3847324321DEB602CD0197; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Modifier1_8_B7DACC89417F7597BF632AB74B114454;      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Modifier1Description_25_51CF62D548AB96AF2D2A8585D0A8A6C9; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Modifier2_13_097CE2AF4783DF5D0F2D6683521C6559;     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Modifier2Descrition_24_C2CB6C8A4D39D588FDBEEA90ABB254C5; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Modifier3_17_A31578E54051E79DB564C4B0B096D34C;     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Modifier3Description_23_B6A5B2AD44AF6AEA6CA027AB52FD23B9; // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      TotemName_36_18B2FA56427168AFC053399DEBD33BDE;     // 0x0068(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Robo_Totem_Balance;

}

