#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trick_CE_Digistruct_Weapon_In

#include "Basic.hpp"

#include "GbxGame_structs.hpp"


namespace SDK::Params
{

// Function Trick_CE_Digistruct_Weapon_In.Trick_CE_Digistruct_Weapon_In_Script_Const_C.OnBegin_Mut
// 0x0010 (0x0010 - 0x0000)
struct Trick_CE_Digistruct_Weapon_In_Script_Const_C_OnBegin_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Trick_CE_Digistruct_Weapon_In_Script_Const_C_OnBegin_Mut;

// Function Trick_CE_Digistruct_Weapon_In.Trick_CE_Digistruct_Weapon_In_Script_Const_C.OnEnd_Mut
// 0x0018 (0x0018 - 0x0000)
struct Trick_CE_Digistruct_Weapon_In_Script_Const_C_OnEnd_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxTrickEnd                                  EndType;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                CallFunc_GetWeapon_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Trick_CE_Digistruct_Weapon_In_Script_Const_C_OnEnd_Mut;

}

